thfisher/GRBL-ESP32/main/boards/my_machine_map.h
/*
  my_machine_map.h - driver code for ESP32

  Part of grblHAL

  Copyright (c) 2024 Terje Io

  grblHAL is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  grblHAL is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with grblHAL. If not, see <http://www.gnu.org/licenses/>.
*/
#define STRINGIFY(x) #x
#define TOSTRING(x) STRINGIFY(x)

#ifndef CONFIG_IDF_TARGET_ESP32
#error "This board has ESP32 processor, select a corresponding build!"
#endif

#define I2S_OUT_BCK             GPIO_NUM_16
#define I2S_OUT_WS              GPIO_NUM_4
#define I2S_OUT_DATA            GPIO_NUM_12
#define I2S_OUT_NUM_BITS	16

#include "use_i2s_out.h"

#if VFD_SPINDLE
#error "Generic map does not have support for VFD spindle."
#endif

#if KEYPAD_ENABLE == 1
#error No free pins for I2C keypad!
#endif

#define UART_TX_PIN         GPIO_NUM_1
#define UART_RX_PIN         GPIO_NUM_3

//#define SERIAL1_PORT // RX: GPIO_NUM_33, TX: GPIO_NUM_43
//#define UART1_RX_PIN		GPIO_NUM_27
//#define UART1_TX_PIN		GPIO_NUM_22

//#pragma message( TOSTRING(N_AXIS) )
//#pragma message( TOSTRING(N_ABC_MOTORS) )
//#pragma message( TOSTRING(N_ABC_AXIS) )
// Define step pulse output pins.
#define X_STEP_PIN              I2SO(11)
#define Y_STEP_PIN              I2SO(13)
#define Z_STEP_PIN              I2SO(15)

// Define step direction output pins. NOTE: All direction pins must be on the same port.
#define X_DIRECTION_PIN         I2SO(10)
#define Y_DIRECTION_PIN         I2SO(12)
#define Z_DIRECTION_PIN         I2SO(14)

// Define stepper driver enable/disable output pin(s).
#define STEPPERS_ENABLE_PIN	I2SO( 9)

// Define homing/hard limit switch input pins and limit interrupt vectors.
#define X_LIMIT_PIN             GPIO_NUM_36
#define Y_LIMIT_PIN             GPIO_NUM_39
#define Z_LIMIT_PIN             GPIO_NUM_26

// Define ganged axis or A axis step pulse and step direction output pins.
#if N_ABC_MOTORS >= 1
#define M3_AVAILABLE
#define M3_STEP_PIN             I2SO( 2)
#define M3_DIRECTION_PIN	I2SO( 1)
#define M3_LIMIT_PIN            GPIO_NUM_35
#endif

// Define ganged axis or B axis step pulse and step direction output pins.
#if N_ABC_MOTORS >= 2
#define M4_AVAILABLE
#define M4_STEP_PIN		I2SO( 4)
#define M4_DIRECTION_PIN	I2SO( 3)
#define M4_LIMIT_PIN            GPIO_NUM_33
#endif

#define AUXOUTPUT0_PIN          GPIO_NUM_32 // Spindle PWM
#define AUXOUTPUT1_PIN          I2SO(6)     // Spindle enable
#define AUXOUTPUT2_PIN          I2SO(5)     // Spindle direction
#define AUXOUTPUT3_PIN          I2SO(7)     // Coolant flood
//#define AUXOUTPUT4_PIN          GPIO_NUM_41 // Coolant mist

// Define driver spindle pins
#if DRIVER_SPINDLE_ENABLE & SPINDLE_PWM
#define SPINDLE_PWM_PIN         AUXOUTPUT0_PIN
#endif
#if DRIVER_SPINDLE_ENABLE & SPINDLE_DIR
#define SPINDLE_DIRECTION_PIN   AUXOUTPUT2_PIN
#endif
#if DRIVER_SPINDLE_ENABLE & SPINDLE_ENA
#define SPINDLE_ENABLE_PIN      AUXOUTPUT1_PIN
#endif

// Define flood and mist coolant enable output pins.
#if COOLANT_ENABLE & COOLANT_FLOOD
#define COOLANT_FLOOD_PIN       AUXOUTPUT3_PIN
#endif
#if COOLANT_ENABLE & COOLANT_MIST
#define COOLANT_MIST_PIN        AUXOUTPUT4_PIN
#endif

#define AUXINPUT0_PIN           GPIO_NUM_33 // Probe
#define AUXINPUT1_PIN           GPIO_NUM_34 // Probe/Toolsetter
#define AUXINPUT2_PIN           GPIO_NUM_17 // Reset/EStop
//#define AUXINPUT3_PIN           GPIO_NUM_25
//#define AUXINPUT4_PIN           GPIO_NUM_21

// Define user-control controls (cycle start, reset, feed hold) input pins.
#if (CONTROL_ENABLE & CONTROL_HALT) && defined(AUXINPUT2_PIN)
#define RESET_PIN               AUXINPUT2_PIN
#endif

#if RGB_LED_ENABLE
#error
#define LED_PIN                 GPIO_NUM_48 // for ESP32-S3-DevKit
#endif

#if PROBE_ENABLE
#ifndef M4_LIMIT_PIN
#define TOOLSETTER_PIN          AUXINPUT1_PIN
#define PROBE_PIN               AUXINPUT0_PIN
#else
#define PROBE_PIN               AUXINPUT1_PIN
#endif
#endif

#if SAFETY_DOOR_ENABLE
#error
#endif

// Define I2C port/pins
#if I2C_ENABLE
#define I2C_PORT                I2C_NUM_1
#define I2C_SDA                 GPIO_NUM_3
#define I2C_SCL                 GPIO_NUM_4
#define I2C_CLOCK               100000
#endif

#if SDCARD_ENABLE
// Pin mapping when using SPI mode.
// With this mapping, SD card can be used both in SPI and 1-line SD mode.
// Note that a pull-up on CS line is required in SD mode.
//#define PIN_NUM_MISO            GPIO_NUM_19
//#define PIN_NUM_MOSI            GPIO_NUM_23
//#define PIN_NUM_CLK             GPIO_NUM_18
//#define PIN_NUM_CS              GPIO_NUM_5
#define SPI_MISO_PIN            GPIO_NUM_19
#define SPI_MOSI_PIN            GPIO_NUM_23
#define SPI_SCK_PIN             GPIO_NUM_18
#define SD_CS_PIN              GPIO_NUM_5
#endif
